packages/foambo/foambo-1.0.0.tar.gz/foambo-1.0.0/examples/multi-objective/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

meshResolution 1;

scale   1.0;

vertices
(
    (0 0 0)
    (0.1 0 0)
    (0.1 0.1 0)
    (0 0.1 0)
    (0 0 0.01)
    (0.1 0 0.01)
    (0.1 0.1 0.01)
    (0 0.1 0.01)
);

res #calc "20*$meshResolution";

blocks
(
    hex (0 1 2 3 4 5 6 7) ($res $res 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
